#define _CRT_SECURE_NO_WARNINGS 1 

#include<stdio.h>




//int main()
//{
//
//	int a = 5, b = 2;
//	//错误运算
//		int sum1 = a / b;          //2 两数都是整型
//		int sum2 = a / (float)b;   //2 未存放在浮点型中
//		float sum3 = a / b;        //2  两数都是整型
//	//正确运算
//		float sum = a / (float)b;  // 2.5
//	return 0;
// }


//int main()
//{
//
//	int a = 4;  //             00000000000000000000000000000111
//	int b = a>>1;//右移一位     00000000000000000000000000000011    右边舍弃1  缩小2倍
//	int c = a << 2;//左移2位    00000000000000000000000000011100     左边舍弃00 扩大2^2倍  
//}


//int main()
//{
//	int a = 5, b = 3;   //  a:5  00000000000000000000000000000101
//	                    //  b:3  00000000000000000000000000000011
//	                    // a&b:1 00000000000000000000000000000001
//	int c = a & b;      // a|b:7 00000000000000000000000000000111
//	int d = a | b;      // a^b:6 00000000000000000000000000000110
//	int e = a ^ b;
//
//}

//int main()
//{
//	int a = 4;
//	int b = -3;
//	int c = 0;
//	printf("!a=%d  !b=%d  !c=%d",!a,!b,!c);
//
//	return 0;
//
// }

//int main()
//{
//	int a = 10;
//	//取地址
//	int* pa = &a;  
//	//解引用
//	*pa = 12;   //等价与 a=12;
//
//	return 0;
//}

//int main()
//{   
//	int i = 0;
//	printf("++i=%d\n",++i);
//	int j = 0;
//	printf("j++=%d", j++);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = 12;
//	if (a == 1 && b == 12)  //a==1判断为假时，不会进行第二个表达式的判断
//	{
//		printf("a=1并且b=12\n");
//	}
//	if (a == 1 || b == 12)  //a==1判断为假时，会继续进行第二个表达式的判断
//	{
//		printf("a=1或者b=12\n");
//	}
//}


int main()
{
	int a = 2, b = 3, c = 4, sum = 0;
	sum = (a++, c = b + 1, c = a + b);
	return 0;
}
